"use client"
import React, { useEffect, useState } from 'react'
import Image from 'next/image'
import { IoBookSharp } from 'react-icons/io5'
import Link from 'next/link'

export default function SingleDirector({ director }) {
    const [sliceText, setSliceText] = useState(500)
    const { name, designation, pro_img } = director;
    const img = `/speech/${pro_img}`
    const message = " বর্তমান যুগ বিজ্ঞান ও তথ্য-প্রযুক্তির উৎকর্ষের যুগ। আধুনিক বিশ্বের সকল ক্ষেত্রে বিজ্ঞান ও তথ্য-প্রযুক্তি পালন করছে জাদুর কাঠির মতো বিস্ময়কর ভূমিকা। শিক্ষা ক্ষেত্রে বিজ্ঞান ও তথ্য-প্রযুক্তির ব্যবহার ইতোমধ্যেই বিশ্বব্যাপী বিরাট আলোড়ন সৃষ্টি করেছে। এ প্রেক্ষাপটে বাংলাদেশ সরকার এদেশের শিক্ষা ব্যবস্থা আধুনিকায়নের লক্ষ্যে বিজ্ঞান ও তথ্য-প্রযুক্তির ব্যবহারকে সর্বাধিক গুরুত্ব দিয়ে সকল শিক্ষা প্রতিষ্ঠানকে অভিন্ন নেটওয়ার্কের আওতায় নিয়ে আসার ব্যাপারে ব্যাপক কর্মসূচি গ্রহণ করেছে। বাংলাদেশের শিক্ষা ব্যবস্থার আধুনিকায়নে সরকারের আহŸানে সাড়া দিয়ে যে সকল শিক্ষা প্রতিষ্ঠান ইতোমধ্যে বিজ্ঞান ভিত্তিক শিক্ষা উপকরণ ও তথ্য-প্রযুক্তির ব্যবহার শুরু করেছে তাদের মধ্যে লালমোহন হা-মীম রেসিডেন্সিয়াল স্কুল এন্ড কলেজ অগ্রগণ্য। ঐতিহ্যবাহী এ শিক্ষা প্রতিষ্ঠানে ইতোমধ্যে বেশ কয়েকটি ডিজিটাল কাস রুম স্থাপন করার পরিকল্পনা গ্রহণ করা হয়েছে। এছাড়াও কলেজের একাডেমিক ও প্রশাসনিক কর্মকান্ডে আরো গতিশীল ও তথ্য-প্রযুক্তি বান্ধব করার লক্ষ্যে একটি সমৃদ্ধ কলেজ ম্যানেজমেন্ট সফ্টওয়্যার সিস্টেম ও ওয়েব সাইট চালু করা হয়েছে। লালমোহন হা-মীম রেসিডেন্সিয়াল স্কুল এন্ড কলেজের সাথে আমার আনন্দ-বেদনার সম্পর্ক, নিশ্বাস-বিশ্বাসের সম্পর্ক, জীবন-জীবিকার সম্পর্ক । এ সম্পর্ক প্রায় বারো বছর অতিক্রান্ত হয়েছে। ০১ জানুয়ারি ২০০৫ সালে যখন এই প্রতিষ্ঠানটি প্রতিষ্ঠা করি তখন টিনের চালা- টিনের বেড়া নিয়ে প্রতিষ্ঠানটি যাত্রা শুরু করে। ২০১০ সালের পর ফলাফলে এবং ২০১২ সালের পর অবকাঠামোগত উন্নয়নে ইতিবাচক পরিবর্তন আসে। প্রাথমিক শিক্ষা সমাপণী পরীক্ষা, জুনিয়র স্কুল সার্টিফিকেট পরীক্ষা ও সেকেন্ডারি স্কুল সার্টিফিকেট পরীক্ষায় বিপুল পরিমাণ জিপিএ ৫.০০ ও ট্যালেন্টপুল ও সাধারণ গ্রেডে বিপুল পরিমাণ বৃত্তি লাভ সহ বরিশাল শিক্ষা বোর্ডে পরপর তৃতীয় ও চতুর্থ স্থান অজনের মধ্য দিয়ে ফলাফলের জগতে স্থান করে নেই আমরা। ততদিনে পশ্চিম ও উত্তর কোন থেকে একতলা দোতলা-তিনতলা করে ভবন উঠতে শুরু করেছে। নির্মিত হয় একাডেমিক ভবন, ছাত্রদের জন্য আবাসিক ভবন। এ যাবৎ যা কিছু নতুন সংযোজন হয়েছে তার মধ্যে কলেজ প্রতিষ্ঠা, একটি আধুনিক বিজ্ঞানাগার প্রতিষ্ঠা (পরিকল্পনাধীন), সকল আবাসিক হলে ছাত্রদের জন্য বিনামূল্যে পানীয় জল সরবরাহ, সকল আবাসিক হলে ও শ্রেণিকক্ষে সার্বণিক বিদ্যুৎ নিশ্চিত করার জন্য উচ্চ মতাসম্পন্ন জেনারেটর, শিক্ষার্থীদের লেখাপড়ার মানোয়ন্নয়ের লক্ষ্যে সকল শ্রেণিকক্ষে ক্লোজ সার্কিট ক্যামেরা (সি.সি ক্যামেরা) স্থাপন, ক্যান্টিন স্থাপন, নিজস্ব পরিবহন ব্যবস্থা, স্কুল ও কলেজ শাখার শিক্ষার্থীদের জন্য স্বয়ংসম্পূর্ণ কম্পিউটার ল্যাব, স্কুল ও কলেজের জন্য পৃথক গ্রন্থাগার চালু করা। এবারকার ২য় সেমিস্টার পরীক্ষার আগে প্রায় সকল শিক্ষার্থীর ছবিযুক্ত প্রবেশপত্র এবং পাঠোন্নতিপত্র প্রদান করা হয়েছে। এ কাজের জন্য সকল শিক্ষার্থীর ডাটাবেজ তৈরি করা হয়েছে। অনুষ্ঠানের আমন্ত্রণ, শিক্ষার্থীর উপস্থিতি-অনুপস্থিতির খতিয়ান, ফলাফল, বেতনাদির বিবরণ এস.এম.এস এর মাধ্যমে সংশ্লিষ্ট সম্মানিত অভিভাবকবৃন্দের কাছে পৌঁছানোর সু-ব্যবস্থা রয়েছে। এ ছারাও রয়েছে ডিজিটাল কাসের ব্যবস্থা যেখানে শিক্ষার্থীরা উৎফুল্ল হয়ে অধির আগ্রহে পড়ালেখার উৎসাহ এবং পাঠ্যবইয়ের যেকোনো সমস্যার সমাধানে অভিজ্ঞ শিক্ষক-শিক্ষিকাদের মাধ্যমে তৎক্ষণাত সহজভাবে পেয়ে থাকে। প্রতিষ্ঠাকাল থেকে প্রতিষ্ঠানটির অগ্রযাত্রায় বিভিন্ন পর্বে ম্যানেজিং কমিটিতে যাঁরা দায়িত্ব পালন করেছেন, তাঁদের সবার প্রতি, আমার গভীর শ্রদ্ধা ও কৃতজ্ঞতা প্রকাশ করছি। ইতোমধ্যে ম্যানেজিং কমিটি, সহকর্মিবৃন্দ, অভিভাবকবৃন্দ এবং শিার্থীবৃন্দের ভেতরে যারা আমাদের ছেড়ে চলে গেছেন পড়পারে, তাদের বিদেহী আত্মার প্রতিও আমি বিন¤্র শ্রদ্ধা জ্ঞাপন করছি। গভর্নিং বডির মাননীয় সভাপতিসহ সম্মানিত সদস্যবৃন্দ, সহকর্মী শিক্ষক-শিক্ষিকাবৃন্দ, সম্পাদনা পরিষদের সবাইকে জানাই আন্তরিক ধন্যবাদ। আল্লাহ হাফেজ।"

    useEffect(() => {
        if (message.length >= 500) {
            let sliceText = message.slice(0, 500)
            setSliceText(sliceText)
        } else {
            setSliceText(message)
        }

    }, [message])

    return (
        <div className='rlative bg-gray-200 pt-4 rounded-xl shadow-sm'>
            <div className='flex flex-col sm:flex-row justify-start items-center gap-x-4 pb-8 px-2'>
                <Image
                    src={img}
                    alt="director Images"
                    width={150}
                    height={150}
                    className='rounded-sm'
                />
                <div>
                    <h1 className='text-xl font-extrabold uppercase'>-{name}
                    </h1>
                    <p className='text-md'>{designation}</p>
                </div>
            </div>
            <p className='text-justify px-2'>
                {sliceText}...
            </p>

            <button className='bg-green-500 text-xl h-12 w-full rounded-b-xl text-gray-300 mt-4'>
                <Link href={`director/${name}/${designation}/message`}>
                    <span className=' flex justify-center items-center gap-x-2'><IoBookSharp />  Read more...</span>
                </Link>
            </button>

        </div>
    )
}
